# Pandas Joins

In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
 df1=pd.DataFrame({"Employee":["Archana","Sana","Thiru","Mani","Kalpana"],"Department":["CSE","ECE","CSE","MECH","IT"]})

In [4]:
df1

  Employee Department
0  Archana        CSE
1     Sana        ECE
2    Thiru        CSE
3     Mani       MECH
4  Kalpana         IT

In [5]:
df2=pd.DataFrame({"Employee":["Archana","Sana","Thiru","Mani","Kalpana"],"YOJ":[2001,2000,2012,2011,2010]})

In [6]:
df2

  Employee   YOJ
0  Archana  2001
1     Sana  2000
2    Thiru  2012
3     Mani  2011
4  Kalpana  2010

In [7]:
pd.merge(df1,df2)

  Employee Department   YOJ
0  Archana        CSE  2001
1     Sana        ECE  2000
2    Thiru        CSE  2012
3     Mani       MECH  2011
4  Kalpana         IT  2010

In [29]:
# one to one

In [8]:
df3=pd.merge(df1,df2)

In [9]:
df3

  Employee Department   YOJ
0  Archana        CSE  2001
1     Sana        ECE  2000
2    Thiru        CSE  2012
3     Mani       MECH  2011
4  Kalpana         IT  2010

In [10]:
df4=pd.DataFrame({"Department":["CSE","ECE","MECH","IT"],"Head":["PSK","KAR","AKT","VJP"]})

In [11]:
df4

  Department Head
0        CSE  PSK
1        ECE  KAR
2       MECH  AKT
3         IT  VJP

In [30]:
# one to many

In [13]:
df5=pd.merge(df3,df4)

In [14]:
df5

  Employee Department   YOJ Head
0  Archana        CSE  2001  PSK
1    Thiru        CSE  2012  PSK
2     Sana        ECE  2000  KAR
3     Mani       MECH  2011  AKT
4  Kalpana         IT  2010  VJP

In [15]:
# Department and Head has 2 duplicates

In [16]:
df6=pd.DataFrame({"Department":['CSE','CSE','ECE','MECH','IT'],"Skill":['CV','Programming','Embedded','ThermoEngineering','Data']})

In [17]:
df6

  Department              Skill
0        CSE                 CV
1        CSE        Programming
2        ECE           Embedded
3       MECH  ThermoEngineering
4         IT               Data

In [18]:
df7=pd.merge(df1,df6)

In [31]:
df1

  Employee Department
0  Archana        CSE
1     Sana        ECE
2    Thiru        CSE
3     Mani       MECH
4  Kalpana         IT

In [32]:
df6

  Department              Skill
0        CSE                 CV
1        CSE        Programming
2        ECE           Embedded
3       MECH  ThermoEngineering
4         IT               Data

In [33]:
# many to many

In [19]:
df7

  Employee Department              Skill
0  Archana        CSE                 CV
1  Archana        CSE        Programming
2    Thiru        CSE                 CV
3    Thiru        CSE        Programming
4     Sana        ECE           Embedded
5     Mani       MECH  ThermoEngineering
6  Kalpana         IT               Data

In [21]:
# It replicates the data once again to match with the dataframe.

# One to one

In [36]:
import pandas as pd

# Create DataFrame1
dataFrame1 = pd.DataFrame(
   {
      "Car": ['BMW', 'Lexus', 'Audi', 'Mustang', 'Bentley', 'Jaguar'],"Units": [100, 150, 110, 80, 110, 90]
   }
)

print("DataFrame1 ...\n",dataFrame1)

# Create DataFrame2
dataFrame2 = pd.DataFrame(
   {
      "Car": ['BMW', 'Lexus', 'Tesla', 'Mustang', 'Mercedes', 'Jaguar'],"Reg_Price": [7000, 1500, 5000, 8000, 9000, 6000]

   }
)

print("\nDataFrame2 ...\n",dataFrame2)

mergedRes = pd.merge(dataFrame1, dataFrame2)
print("\nMerged dataframe with one-to-one relation...\n", mergedRes)

DataFrame1 ...
        Car  Units
0      BMW    100
1    Lexus    150
2     Audi    110
3  Mustang     80
4  Bentley    110
5   Jaguar     90

DataFrame2 ...
         Car  Reg_Price
0       BMW       7000
1     Lexus       1500
2     Tesla       5000
3   Mustang       8000
4  Mercedes       9000
5    Jaguar       6000

Merged dataframe with one-to-one relation...
        Car  Units  Reg_Price
0      BMW    100       7000
1    Lexus    150       1500
2  Mustang     80       8000
3   Jaguar     90       6000

# One to many

In [34]:
dataFrame1 = pd.DataFrame(
   {
      "Car": ['BMW', 'Lexus', 'Audi', 'Mustang', 'Bentley', 'Jaguar'],"Units": [100, 150, 110, 80, 110, 90]
   }
)

print("DataFrame1 ...\n",dataFrame1)

dataFrame2 = pd.DataFrame(
   {
      "Car": ['BMW', 'Lexus', 'Tesla', 'Mustang', 'Mercedes', 'Jaguar'],"Reg_Price": [7000, 1500, 5000, 8000, 9000, 6000]

   }
)

print("\nDataFrame2 ...\n",dataFrame2)

mergedRes = pd.merge(dataFrame1, dataFrame2)
print("\nMerged dataframe with one-to-many relation...\n", mergedRes)

DataFrame1 ...
        Car  Units
0      BMW    100
1    Lexus    150
2     Audi    110
3  Mustang     80
4  Bentley    110
5   Jaguar     90

DataFrame2 ...
         Car  Reg_Price
0       BMW       7000
1     Lexus       1500
2     Tesla       5000
3   Mustang       8000
4  Mercedes       9000
5    Jaguar       6000

Merged dataframe with one-to-many relation...
        Car  Units  Reg_Price
0      BMW    100       7000
1    Lexus    150       1500
2  Mustang     80       8000
3   Jaguar     90       6000

# Many to one

In [35]:
dataFrame1 = pd.DataFrame(
   {
      "Car": ['BMW', 'Audi', 'Mustang', 'Bentley', 'Jaguar'],"Units": [100, 110, 80, 110, 90]
   }
)

print("DataFrame1 ...\n",dataFrame1)

# Create DataFrame2
dataFrame2 = pd.DataFrame(
   {
      "Car": ['BMW', 'Lexus', 'Tesla', 'Mustang', 'Mercedes', 'Jaguar'],"Reg_Price": [7000, 1500, 5000, 8000, 9000, 6000]

   }
)

print("\nDataFrame2 ...\n",dataFrame2)

mergedRes = pd.merge(dataFrame1, dataFrame2)
print("\nMerged dataframe with many-to-one relation...\n", mergedRes)

DataFrame1 ...
        Car  Units
0      BMW    100
1     Audi    110
2  Mustang     80
3  Bentley    110
4   Jaguar     90

DataFrame2 ...
         Car  Reg_Price
0       BMW       7000
1     Lexus       1500
2     Tesla       5000
3   Mustang       8000
4  Mercedes       9000
5    Jaguar       6000

Merged dataframe with many-to-one relation...
        Car  Units  Reg_Price
0      BMW    100       7000
1  Mustang     80       8000
2   Jaguar     90       6000